React_Module_Scripts/React_Employee_Module_Cache_check/React_Get_Api_Load_Test.yml
execution:
#- executor: jmeter
- concurrency: 50
  ramp-up: 50s
  hold-for: 50m
  scenario: React_Cache_Employee_Module

scenarios:
  React_Cache_Employee_Module:
    script: React_Cache_Employee_Module.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed